app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.page(params[:page]).per(5)
---
SELECT  `blogs`.* FROM `blogs` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `blogs`