app/controllers/portfolios_controller.rb

def index
@portfolio_items =  Portfolio.all
---
SELECT `portfolios`.* FROM `portfolios`

def show

 @portfolio_item = Portfolio.find(params[:id])
---
SELECT  `portfolios`.* FROM `portfolios` WHERE `portfolios`.`id` = 1 LIMIT 1